In [3]:
#given code
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [7]:
#Q1. Write a code to print the data present in the second row of the dataframe, df.

#For printing second row we use loc function which is inbuilt function
#to specifiy row/column. loc works on both index and objects whereas, iloc works on 
#integer position based only
print("The data present in the second ro of given dataframe is: ")
df.loc[1]

The data present in the second ro of given dataframe is:

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

In [8]:
#Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?
'''The main distinction between loc and iloc is: loc is label-based, 
which means that we have to specify rows and columns based on their 
row and column labels. iloc is integer position-based, 
so we have to specify rows and columns by their integer position values (0-based integer position)'''

'The main distinction between loc and iloc is: loc is label-based, \nwhich means that you have to specify rows and columns based on their \nrow and column labels. iloc is integer position-based, \nso we have to specify rows and columns by their integer position values (0-based integer position)'

In [9]:
'''Q3. Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
then find the output for both new_df.loc[2] and new_df.iloc[2].
Did you observe any difference in both the outputs? If so then explain it.

In [11]:
#printing df that we already have
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [20]:
#reindexing our data frame
new_df = df.reindex([3,0,1,2])

In [21]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [22]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [23]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

'''As like above question we see that difference here clearly and that is iloc takes the value 2 like
an integerposition, so it prints machine learning which is in the 2-index position of given df.where as 
loc takes the label value'''

In [24]:
#Consider the below code to answer further questions:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [25]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.809353  0.572045  0.815263  0.333395  0.527701  0.241885
2  0.707878  0.061407  0.863435  0.096318  0.454040  0.245555
3  0.173679  0.753537  0.995889  0.368551  0.139437  0.688247
4  0.901609  0.240540  0.132144  0.351584  0.042772  0.346350
5  0.225081  0.836353  0.466129  0.835831  0.074914  0.232679
6  0.409468  0.996817  0.131314  0.637545  0.947120  0.782669

In [28]:
'''Q4. Write a code to find the following statistical measurements for the above dataframe df1:
(i) mean of each and every column present in the dataframe.
(ii) standard deviation of column, ‘column_2’'''

#Here we use the mathematical function mean to find the mean of given data
#For claculating mean of particular value we should mention that particular column .
#But here , we want to calculate each and every column 
#so,here we take directly as like df1.mean()
print("...Mean of each and every column present in dataframe df1 is...")
df1.mean()

...Mean of each and every column present in dataframe df1 is...

column_1    0.537845
column_2    0.576783
column_3    0.567362
column_4    0.437204
column_5    0.364331
column_6    0.422897
dtype: float64

In [29]:
#calculating standard deviation using pandas inbulit function std
print("...Standard deviation of each and every column present in dataframe df2 is...")
df1.std()

...Standard deviation of each and every column present in dataframe df2 is...

column_1    0.310442
column_2    0.361591
column_3    0.380145
column_4    0.260024
column_5    0.349891
column_6    0.247428
dtype: float64

In [30]:
'''Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
mean of column, column_2.
If you are getting errors in executing it then explain why.
[Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]'''

#taking dataframe which is given
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.809353  0.572045  0.815263  0.333395  0.527701  0.241885
2  0.707878  0.061407  0.863435  0.096318  0.454040  0.245555
3  0.173679  0.753537  0.995889  0.368551  0.139437  0.688247
4  0.901609  0.240540  0.132144  0.351584  0.042772  0.346350
5  0.225081  0.836353  0.466129  0.835831  0.074914  0.232679
6  0.409468  0.996817  0.131314  0.637545  0.947120  0.782669

In [35]:
#replacing second row of column by column_2 by a string variable
#for this we are using loc function for choosing column place 2,anf for changing the partcular place we choose that partcualr
#column also.Since we know loc works on both 
df1.loc[2,'column_2'] = "DataScience"

In [36]:
df1

   column_1     column_2  column_3  column_4  column_5  column_6
1  0.809353     0.572045  0.815263  0.333395  0.527701  0.241885
2  0.707878  DataScience  0.863435  0.096318  0.454040  0.245555
3  0.173679     0.753537  0.995889  0.368551  0.139437  0.688247
4  0.901609      0.24054  0.132144  0.351584  0.042772  0.346350
5  0.225081     0.836353  0.466129  0.835831  0.074914  0.232679
6  0.409468     0.996817  0.131314  0.637545  0.947120  0.782669

In [38]:
df1['column_3'].mean()

0.5673622142365474

In [42]:
try:
    df1['column_2'].mean()
except:
    print("Mean calculated between integer values only.So, you got an error because there is a string in between int values")

Mean calculated between integer values only.So, you got an error because there is a string in between int values

In [43]:
'''Q6. What do you understand about the windows function in pandas and list the types of windows
functions?'''

'Q6. What do you understand about the windows function in pandas and list the types of windows\nfunctions?'

In [45]:
'''Windows function is used to calculate analytical values over a range of values.'''
df1.rolling(window=1).mean()
#rolling helps to go from one label to another label
#window=1 means having one data set for calculating mean

/tmp/ipykernel_85/3365493846.py:2: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['column_2'], dtype='object')
  df1.rolling(window=1).mean()

   column_1  column_3  column_4  column_5  column_6
1  0.809353  0.815263  0.333395  0.527701  0.241885
2  0.707878  0.863435  0.096318  0.454040  0.245555
3  0.173679  0.995889  0.368551  0.139437  0.688247
4  0.901609  0.132144  0.351584  0.042772  0.346350
5  0.225081  0.466129  0.835831  0.074914  0.232679
6  0.409468  0.131314  0.637545  0.947120  0.782669

In [47]:
df1.rolling(window=2).mean()
#window = 2 means having 2 data sets for mean i.e one itself and other is 
#previous one and then take the average of two.
#firstly we have 1 and previous is no one so nan 
# after checking the values of 2 and 1

/tmp/ipykernel_85/3023045461.py:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['column_2'], dtype='object')
  df1.rolling(window=2).mean()

   column_1  column_3  column_4  column_5  column_6
1       NaN       NaN       NaN       NaN       NaN
2  0.758616  0.839349  0.214857  0.490871  0.243720
3  0.440779  0.929662  0.232435  0.296739  0.466901
4  0.537644  0.564016  0.360068  0.091105  0.517299
5  0.563345  0.299136  0.593708  0.058843  0.289515
6  0.317275  0.298721  0.736688  0.511017  0.507674

In [48]:
#Q7. Write a code to print only the current month and year at the time of answering this question.
#[Hint: Use pandas.datetime function]

#importing pandas module
#importing date and time also
import pandas as pd
from datetime import datetime

#taking current date
currentDate = datetime.now()
#executing current month year using strftime
#The Strftime() function is used to convert date and time objects 
#to their string representation
current_month_year = currentDate.strftime("%B%Y")

In [51]:
print(currentDate)

2024-01-23 03:06:24.059604

In [49]:
print(current_month_year)

January2024

In [52]:
'''Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
calculates the difference between them in days, hours, and minutes using Pandas time delta. The
program should prompt the user to enter the dates and display the result.'''
time = pd.Timedelta(days=1,hours = 5,minutes = 55)

In [53]:
df = pd.to_datetime(['2022-06-20','2022-06-21'])

In [55]:
df+time

DatetimeIndex(['2022-06-21 05:55:00', '2022-06-22 05:55:00'], dtype='datetime64[ns]', freq=None)

In [ ]:
'''Q11. You are given a CSV file containing student data that includes the student ID and their test score. Write
a Python program that reads the CSV file, calculates the mean, median, and mode of the test scores, and
displays the results in a table.

The program should do the followingM
I Prompt the user to enter the file path of the CSV file containing the student dataR
I Read the CSV file into a Pandas DataFrameR
I Calculate the mean, median, and mode of the test scores using Pandas toolsR
I Display the mean, median, and mode in a table.
Assume the CSV file contains the following columnsM
I Student ID: The ID of the studentR
I Test Score: The score of the student's test.
Example usage of the program:
Enter the file path of the CSV file containing the student data: student_data.csv

Assume that the CSV file student_data.csv contains the following data:
Student ID,Test Score
1,85
2,90
3,80
4,75
5,85
6,82
7,78
8,85
9,90
10,85'''

In [56]:
#importing pandas module
#for reading csv files use
#pd.read_csv("file path in form of csv")
import pandas as pd
#taking data to calculate mean median and ,mode
data = {"Student ID":[1,2,3,4,5,6,7,8,9,10],"Test Score":[85,90,80,75,85,82,78,85,90,85]}
#creating dataframe
df = pd.DataFrame(data)

In [57]:
df

   Student ID  Test Score
0           1          85
1           2          90
2           3          80
3           4          75
4           5          85
5           6          82
6           7          78
7           8          85
8           9          90
9          10          85

In [63]:
#clacuting mean,median and mode for pandas dataframe using inbuilt functions
x = df['Test Score'].mean()
print(f"Mean of testcore is: {x}")

Mean of testcore is: 83.5

In [64]:
y = df['Test Score'].median()
print(f"Median of testcore is: {y}")

Median of testcore is: 85.0

In [65]:
z = df['Test Score'].mode()
print(f"Mode of testcore is: {z}")

Mode of testcore is: 0    85
Name: Test Score, dtype: int64